tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'AdoptOpenJDK/openjdk'

brew 'adoptopenjdk-openjdk8'
brew 'ansible'
brew 'apache-spark'
brew 'aria2'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'binutils'
brew 'coreutils'
brew 'dep'
brew 'direnv'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine', restart_service: true
brew 'docker-machine-nfs'
brew 'elixir'
brew 'exiftool'
brew 'findutils'
brew 'gawk'
brew 'gist'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'graphviz'
brew 'hiredis'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'kafka'
brew 'lame'
brew 'llvm'
brew 'markdown'
brew 'maven'
brew 'mercurial'
brew 'moreutils'
brew 'mysql'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'pdsh'
brew 'pngcrush'
brew 'postgresql'
brew 'protobuf'
brew 'pwgen'
brew 'rdesktop'
brew 'redis'
brew 'rename'
brew 'ripgrep'
brew 'ruby'
brew 's3cmd'
brew 'sane-backends'
brew 'sbt'
brew 'scala'
brew 'tidy-html5'
brew 'tree'
brew 'unrar'
brew 'upx'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wine', args: ['force-bottle']
brew 'wrk'
brew 'yarn'

cask 'dropbox'
cask 'firefox'
cask 'font-source-code-pro-for-powerline'
cask 'gimp'
cask 'google-chrome'
cask 'gpg-suite'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'keepingyouawake'
cask 'keka'
cask 'kid3'
cask 'libreoffice'
cask 'psequel'
cask 'rekordbox'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'tor-browser'
cask 'transmission'
cask 'tunnelblick'
cask 'virtualbox'
cask 'vlc'
