tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'binutils'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'entr'
brew 'exiftool'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'fish'
brew 'flac'
brew 'gawk'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'gpg'
brew 'htop'
brew 'hub'
brew 'id3v2'
brew 'imagemagick'
brew 'ipcalc'
brew 'ipmitool'
brew 'jq'
brew 'lame'
brew 'llvm'
brew 'maven'
brew 'mercurial'
brew 'moreutils'
brew 'mysql'
brew 'ninja'
brew 'nmap'
brew 'node'
brew 'openjdk'
brew 'openssl'
brew 'pcre'
brew 'pdsh'
brew 'pkg-config'
brew 'pngcrush'
brew 'postgresql'
brew 'protobuf'
brew 'pwgen'
brew 'rename'
brew 'ripgrep'
brew 'ruby'
brew 'sbt'
brew 'scala'
brew 'shellcheck'
brew 'sox'
brew 'svn'
brew 'terraform'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wrk'
brew 'zsh'

cask 'clion'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'gimp'
cask 'google-chrome'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'keepingyouawake'
cask 'obs'
cask 'rectangle'
cask 'sequel-pro'
cask 'slack'
cask 'sysex-librarian'
cask 'tor-browser'
cask 'transmission'
cask 'tunnelblick'
cask 'visualvm'
cask 'vlc'
cask 'wireshark'
