tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'adoptopenjdk/openjdk'

# Some brews need Java, install it first
cask 'adoptopenjdk'
cask 'adoptopenjdk8'
cask 'adoptopenjdk/openjdk/adoptopenjdk8'

brew 'ansible'
brew 'aria2'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'binutils'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine', restart_service: true
brew 'docker-machine-nfs'
brew 'exiftool'
brew 'findutils'
brew 'flac'
brew 'gawk'
brew 'gist'
brew 'git'
brew 'gnu-sed'
brew 'go'
brew 'gpg'
brew 'graphviz'
brew 'htop'
brew 'hub'
brew 'id3v2'
brew 'imagemagick'
brew 'ipmitool'
brew 'jq'
brew 'lame'
brew 'maven'
brew 'mercurial'
brew 'moreutils'
brew 'mysql'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'pcre'
brew 'pdsh'
brew 'pkg-config'
brew 'pngcrush'
brew 'postgresql'
brew 'protobuf'
brew 'pwgen'
brew 'rename'
brew 'ripgrep'
brew 'ruby'
brew 's3cmd'
brew 'sane-backends'
brew 'sbt'
brew 'scala'
brew 'shellcheck'
brew 'terraform'
brew 'tidy-html5'
brew 'tree'
brew 'unrar'
brew 'vault'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'wrk'

cask 'ableton-live-suite'
cask 'dropbox'
cask 'firefox'
cask 'font-source-code-pro-for-powerline'
cask 'google-chrome'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'keepingyouawake'
cask 'keka'
cask 'kid3'
cask 'psequel'
cask 'rekordbox'
cask 'sequel-pro'
cask 'slack'
cask 'spectacle'
cask 'tor-browser'
cask 'transmission'
cask 'tunnelblick'
cask 'virtualbox'
cask 'visualvm'
cask 'vlc'
